{
    "name": "Banishment",
    "level": "4th Level",
    "type": "Abjuration",
    "casttime": "1 action",
    "range": "60 ft",
    "components": "V, S, M",
    "duration": "Concentration, up to 1 minute",
    "description": "You attempt to send one creature that you can see within range to another plane of existence. The target must succeed on a Charisma saving throw or be banished. If the target is native to the plane of existence you’re on, you banish the target to a harmless demiplane. While there, the target is incapacitated. The target remains there until the spell ends, at which point the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. If the target is native to a different plane of existence than the one you’re on, the target is banished with a faint popping noise, returning to its home plane. If the spell ends before 1 minute has passed, the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. Otherwise, the target doesn't return. At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Cleric", "Paladin", "Sorcerer", "Warlock", "Wizard"]
}, {
    "name": "Blight",
    "level": "4th Level",
    "type": "Necromancy",
    "casttime": "1 action",
    "range": "30 ft",
    "components": "V, S",
    "duration": "Instant",
    "description": "Necromantic energy washes over a creature of your choice that you can see within range, draining moisture and vitality from it. The target must make a Constitution saving throw. The target takes 8d8 necrotic damage on a failed save, or half as much damage on a successful one. This spell has no effect on undead or constructs. If you target a plant creature or a magical plant, it makes the saving throw with disadvantage, and the spell deals maximum damage to it. If you target a nonmagical plant that isn’t a creature, such as a tree or shrub, it doesn’t make a saving throw; it simply withers and dies. At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d8 for each slot level above 4th.",
    "damagetype": "Necrotic",
    "die": "8d8",
    "learnedby": ["Druid", "Sorcerer", "Warlock", "Wizard"]
}, {
    "name": "Confusion",
    "level": "4th Level",
    "type": "Enchantment",
    "casttime": "1 action",
    "range": "90 ft",
    "components": "V, S, M",
    "duration": "Concentration, up to 1 minute",
    "description": "This spell assaults and twists creatures' minds, spawning delusions and provoking uncontrolled action. Each creature in a 10-foot-radius sphere centered on a point you choose within range must succeed on a Wisdom saving throw when you cast this spell or be affected by it. An affected target can’t take reactions and must roll a d10 at the start of each of its turns to determine its behavior for that turn. d10 Behavior 1 The creature uses all its movement to move in a random direction. To determine the direction, roll a d8 and assign a direction to each die face. The creature doesn’t take an action this turn. 2-6 The creature doesn’t move or take actions this turn. 7-8 The creature uses its action to make a melee attack against a randomly determined creature within its reach. If there is no creature within its reach, the creature does nothing this turn. 9-10 The creature can act and move normally. At the end of each of its turns, an affected target can make a Wisdom saving throw. If it succeeds, this effect ends for that target. At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the radius of the sphere increases by 5 feet for each slot level above 4th.",
    "damagetype": "None",
    "die": "1d10",
    "learnedby": ["Bard", "Druid", "Sorcerer", "Wizard"]
}, {
    "name": "Dimension Door",
    "level": "4th Level",
    "type": "Conjuration",
    "casttime": "1 action",
    "range": "500 ft",
    "components": "V",
    "duration": "Instant",
    "description": "You teleport yourself from your current location to any other spot within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as “200 feet straight downward” or “upward to the northwest at a 45-degree angle, 300 feet.” You can bring along objects as long as their weight doesn’t exceed what you can carry. You can also bring one willing creature of your size or smaller who is carrying gear up to its carrying capacity. The creature must be within 5 feet of you when you cast this spell. If you would arrive in a place already occupied by an object or a creature, you and any creature traveling with you each take 4d6 force damage, and the spell fails to teleport you.",
    "damagetype": "On failure: Force",
    "die": "On failure: 4d6",
    "learnedby": ["Bard", "Sorcerer", "Warlock", "Wizard"]
}, {
    "name": "Dominate Beast",
    "level": "4th Level",
    "type": "Enchantment",
    "casttime": "1 action",
    "range": "60 ft",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "description": "You attempt to beguile a beast that you can see within range. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw. While the beast is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as “Attack that creature,” “Run over there,” or “Fetch that object.” If the creature completes the order and doesn’t receive further direction from you, it defends and preserves itself to the best of its ability. You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn’t do anything that you don’t allow it to do. During this time, you can also cause the creature to use a reaction, but this requires you to use your own reaction as well. Each time the target takes damage, it makes a new Wisdom saving throw against the spell. If the saving throw succeeds, the spell ends. At Higher Levels. When you cast this spell with a 5th-level spell slot, the duration is concentration, up to 10 minutes. When you use a 6th-level spell slot, the duration is concentration, up to 1 hour. When you use a spell slot of 7th level or higher, the duration is concentration, up to 8 hours.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Druid", "Sorcerer"]
}, {
    "name": "Greater Invisibility",
    "level": "4th Level",
    "type": "Illusion",
    "casttime": "1 action",
    "range": "Touch",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "description": "You or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Bard", "Sorcerer", "Wizard"]
}, {
    "name": "Ice Storm",
    "level": "4th Level",
    "type": "Evocation",
    "casttime": "1 action",
    "range": "300 ft",
    "components": "V, S, M",
    "duration": "Instant",
    "description": "A hail of rock-hard ice pounds to the ground in a 20-foot-radius, 40-foot-high cylinder centered on a point within range. Each creature in the cylinder must make a Dexterity saving throw. A creature takes 2d8 bludgeoning damage and 4d6 cold damage on a failed save, or half as much damage on a successful one. Hailstones turn the storm's area of effect into difficult terrain until the end of your next turn. At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the bludgeoning damage increases by 1d8 for each slot level above 4th.",
    "damagetype": "Bludgeoning, Cold",
    "die": "2d8, 4d6",
    "learnedby": ["Druid", "Sorcerer", "Wizard"]
}, {
    "name": "Polymorph",
    "level": "4th Level",
    "type": "Transmutation",
    "casttime": "1 action",
    "range": "60 ft",
    "components": "V, S, M",
    "duration": "Concentration, up to 1 hour",
    "description": "This spell transforms a creature that you can see within range into a new form. An unwilling creature must make a Wisdom saving throw to avoid the effect. A shapechanger automatically succeeds on this saving throw. The transformation lasts for the duration, or until the target drops to 0 hit points or dies. The new form can be any beast whose challenge rating is equal to or less than the target’s (or the target’s level, if it doesn't have a challenge rating). The target’s game statistics, including mental ability scores, are replaced by the statistics of the chosen beast. It retains its alignment and personality. The target assumes the hit points of its new form. When it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn’t reduce the creature’s normal form to 0 hit points, it isn’t knocked unconscious. The creature is limited in the actions it can perform by the nature of its new form, and it can’t speak, cast spells, or take any other action that requires hands or speech. The target’s gear melds into the new form. The creature can’t activate, use, wield, or otherwise benefit from any of its equipment.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Bard", "Druid", "Sorcerer", "Wizard"]
}, {
    "name": "Stone Skin",
    "level": "4th Level",
    "type": "Abjuration",
    "casttime": "1 action",
    "range": "Touch",
    "components": "V, S, M",
    "duration": "Concentration, up to 1 hour",
    "description": "This spell turns the flesh of a willing creature you touch as hard as stone. Until the spell ends, the target has resistance to nonmagical bludgeoning, piercing, and slashing damage.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Druid", "Ranger", "Sorcerer", "Wizard"]
}, {
    "name": "Wall of Fire",
    "level": "4th Level",
    "type": "Evocation",
    "casttime": "1 action",
    "range": "120 ft",
    "components": "V, S, M",
    "duration": "Concentration, up to 1 minute",
    "description": "You create a wall of fire on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration. When the wall appears, each creature within its area must make a Dexterity saving throw. On a failed save, a creature takes 5d8 fire damage, or half as much damage on a successful save. One side of the wall, selected by you when you cast this spell, deals 5d8 fire damage to each creature that ends its turn within 10 feet of that side or inside the wall. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. The other side of the wall deals no damage. At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d8 for each slot level above 4th.",
    "damagetype": "Fire",
    "die": "5d8",
    "learnedby": ["Druid", "Sorcerer", "Wizard"]
}
