{
    "name": "Aid",
    "level": "2nd Level",
    "type": "Abjuration",
    "casttime": "1 action",
    "range": "30 ft",
    "components": "V, S, M",
    "duration": "8 hours",
    "description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target’s hit point maximum and current hit points increase by 5 for the duration. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, a target’s hit points increase by an additional 5 for each slot level above 2nd.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Cleric", "Paladin"]
}, {
    "name": "Alter Self",
    "level": "2nd Level",
    "type": "Transmutation",
    "casttime": "1 action",
    "range": "Self",
    "components": "V, S",
    "duration": "Concentration, up to 1 hour",
    "description": "You assume a different form. When you cast the spell, choose one of the following options, the effects of which last for the duration of the spell. While the spell lasts,you can end one option as an action to gain the benefits of a different one. Aquatic Adaptation. You adapt your body to an aquatic environment, sprouting gills and growing webbing between your fingers. You can breathe underwater and gain a swimming speed equal to your walking speed. Change Appearance. You transform your appearance. You decide what you look like, including your height, weight, facial features, sound of your voice, hair length, coloration, and distinguishing characteristics, if any. You can make yourself appear as a member of another race, though none of your statistics change. You also can’t appear as a creature of a different size than you, and your basic shape stays the same; if you're bipedal, you can’t use this spell to become quadrupedal, for instance. At any time for the duration of the spell, you can use your action to change your appearance in this way again. Natural Weapons. You grow claws, fangs, spines, horns, or a different natural weapon of your choice. Your unarmed strikes deal 1d6 bludgeoning, piercing, or slashing damage, as appropriate to the natural weapon you chose, and you are proficient with your unarmed strikes. Finally, the natural weapon is magic and you have a +1 bonus to the attack and damage rolls you make using it.",
    "damagetype": "Natural Weapons: piercing, bludgeoning, slashing",
    "die": "Natural Weapons: 1d6",
    "learnedby": ["Sorcerer", "Warlock"]
}, {
    "name": "Animal Messenger",
    "level": "2nd Level",
    "type": "Enchantment, ritual",
    "casttime": "1 action",
    "range": "30 ft",
    "components": "V, S, M",
    "duration": "24 hours",
    "description": "By means of this spell, you use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description, such as “a man or woman dressed in the uniform of the town guard” or “a red-haired dwarf wearing a pointed hat.” You also speak a message of up to twenty-five words. The target beast travels for the duration of the spell toward the specified location, covering about 50 miles per 24 hours for a flying messenger, or 25 miles for other animals. When the messenger arrives, it delivers your message to the creature that you described, replicating the sound of your voice. The messenger speaks only to a creature matching the description you gave. If the messenger doesn’t reach its destination before the spell ends, the message is lost, and the beast makes its way back to where you cast this spell. At Higher Levels. If you cast this spell using a spell slot of 3nd level or higher, the duration of the spell increases by 48 hours for each slot level above 2nd.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Bard", "Druid", "Ranger"]
}, {
    "name": "Blindness/Deafness",
    "level": "2nd Level",
    "type": "Necromancy",
    "casttime": "1 action",
    "range": "30 ft",
    "components": "V",
    "duration": "1 minute",
    "description": "You can blind or deafen a foe. Choose one creature that you can see within range to make a Constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a Constitution saving throw. On a success, the spell ends. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Bard", "Cleric", "Sorcerer", "Wizard"]
}, {
    "name": "Blur",
    "level": "2nd Level",
    "type": "Illusion",
    "casttime": "1 action",
    "range": "Self",
    "components": "V",
    "duration": "Concentration, up to 1 minute",
    "description": "Your body becomes blurred, shifting and wavering to all who can see you. For the duration, any creature has disadvantage on attack rolls against you. An attacker is immune to this effect if it doesn’t rely on sight, as with blindsight, or can see through illusions, as with truesight.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Sorcerer", "Wizard"]
}, {
    "name": "Cloud of Daggers",
    "level": "2nd Level",
    "type": "Conjuration",
    "casttime": "1 action",
    "range": "60 ft",
    "components": "V, S, M",
    "duration": "Concentration, up to 1 minute",
    "description": "You fill the air with spinning daggers in a cube 5 feet on each side, centered on a point you choose within range. A creature takes 4d4 slashing damage when it enters the spell’s area for the first time on a turn or starts its turn there. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 2d4 for each slot level above 2nd.",
    "damagetype": "Slashing",
    "die": "4d4",
    "learnedby": ["Bard", "Sorcerer", "Warlock", "Wizard"]
}, {
    "name": "Crown of Madness",
    "level": "2nd Level",
    "type": "Enchantment",
    "casttime": "1 action",
    "range": "120 ft",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "description": "One humanoid of your choice that you can see within range must succeed on a Wisdom saving throw or become charmed by you for the duration. While the target is charmed in this way, a twisted crown of jagged iron appears on its head, and a madness glows in its eyes. The charmed target must use its action before moving on each of its turns to make a melee attack against a creature other than itself that you mentally choose. The target can act normally on its turn if you choose no creature or if none are within its reach. On your subsequent turns, you must use your action to maintain control over the target, or the spell ends. Also, the target can make a Wisdom saving throw at the end of each of its turns. On a success, the spell ends.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Bard", "Sorcerer", "Warlock", "Wizard"]
}, {
    "name": "Darkness",
    "level": "2nd Level",
    "type": "Evocation",
    "casttime": "1 action",
    "range": "60 ft",
    "components": "V, M",
    "duration": "Concentration, up to 10 minutes",
    "description": "Magical darkness spreads from a point you choose within range to fill a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can’t see through this darkness, and nonmagical light can’t illuminate it. If the point you choose is on an object you are holding or one that isn’t being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness. If any of this spell’s area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Sorcerer", "Warlock", "Wizard"]
}, {
    "name": "Detect Thoughts",
    "level": "2nd Level",
    "type": "Divination",
    "casttime": "1 action",
    "range": "Self",
    "components": "V, S, M",
    "duration": "Concentration",
    "description": "For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 30 feet of you. If the creature you choose has an Intelligence of 3 or lower or doesn’t speak any language, the creature is unaffected. You initially learn the surface thoughts of the creature—what is most on its mind in that moment. As an action, you can either shift your attention to another creature’s thoughts or attempt to probe deeper into the same creature’s mind. If you probe deeper, the target must make a Wisdom saving throw. If it fails, you gain insight into its reasoning (if any), its emotional state, and something that looms large in its mind (such as something it worries over, loves, or hates). If it succeeds, the spell ends. Either way, the target knows that you are probing into its mind, and unless you shift your attention to another creature’s thoughts, the creature can use its action on its turn to make an Intelligence check contested by your Intelligence check; if it succeeds, the spell ends. Questions verbally directed at the target creature naturally shape the course of its thoughts, so this spell is particularly effective as part of an interrogation. You can also use this spell to detect the presence of thinking creatures you can’t see. When you cast the spell or as your action during the duration, you can search for thoughts within 30 feet of you. The spell can penetrate barriers, but 2 feet of rock, 2 inches of any metal other than lead, or a thin sheet of lead blocks you. You can’t detect a creature with an Intelligence of 3 or lower or one that doesn’t speak any language. Once you detect the presence of a creature in this way, you can read its thoughts for the rest of the duration as described above, even if you can’t see it, but it must still be within range.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Bard", "Sorcerer", "Wizard"]
}, {
    "name": "Enhance Ability",
    "level": "2nd Level",
    "type": "Transmutation",
    "casttime": "1 action",
    "range": "Touch",
    "components": "V, S, M",
    "duration": "Concentration, up to 1 hour",
    "description": "You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains that effect until the spell ends. Bear’s Endurance. The target has advantage on Constitution checks. It also gains 2d6 temporary hit points, which are lost when the spell ends. Bull’s Strength. The target has advantage on Strength checks, and his or her carrying capacity doubles. Cat’s Grace. The target has advantage on Dexterity checks. It also doesn’t take damage from falling 20 feet or less if it isn’t incapacitated. Eagle’s Splendor. The target has advantage on Charisma checks. Fox’s Cunning. The target has advantage on Intelligence checks. Owl’s Wisdom. The target has advantage on Wisdom checks. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.",
    "damagetype": "None",
    "die": "Bear's Endurance: 2d6",
    "learnedby": ["Bard", "Cleric", "Druid", "Sorcerer"]
}, {
    "name": "Enlarge/Reduce",
    "level": "2nd Level",
    "type": "Transmutation",
    "casttime": "1 action",
    "range": "30 ft",
    "components": "V, S, M",
    "duration": "Concentration, up to 1 minute",
    "description": "You cause a creature or an object you can see within range to grow larger or smaller for the duration. Choose either a creature or an object that is neither worn nor carried. If the target is unwilling, it can make a Constitution saving throw. On a success, the spell has no effect. If the target is a creature, everything it is wearing and carrying changes size with it. Any item dropped by an affected creature returns to normal size at once. Enlarge. The target’s size doubles in all dimensions, and its weight is multiplied by eight. This growth increases its size by one category—from Medium to Large, for example. If there isn’t enough room for the target to double its size, the creature or object attains the maximum possible size in the space available. Until the spell ends, the target also has advantage on Strength checks and Strength saving throws. The target’s weapons also grow to match its new size. While these weapons are enlarged, the target’s attacks with them deal 1d4 extra damage. Reduce. The target’s size is halved in all dimensions, and its weight is reduced to one-eighth of normal. This reduction decreases its size by one category—from Medium to Small, for example. Until the spell ends, the target also has disadvantage on Strength checks and Strength saving throws. The target’s weapons also shrink to match its new size. While these weapons are reduced, the target’s attacks with them deal 1d4 less damage (this can’t reduce the damage below 1).",
    "damagetype": "None",
    "die": "1d4",
    "learnedby": ["Sorcerer", "Wizard"]
}, {
    "name": "Gust of Wind",
    "level": "2nd Level",
    "type": "Evocation",
    "casttime": "1 action",
    "range": "Self (60 ft line)",
    "components": "V, S, M",
    "duration": "Concentration, up to 1 minute",
    "description": "A line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the spell’s duration. Each creature that starts its turn in the line must succeed on a Strength saving throw or be pushed 15 feet away from you in a direction following the line. Any creature in the line must spend 2 feet of movement for every 1 foot it moves when moving closer to you. The gust disperses gas or vapor, and it extinguishes candles, torches, and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them. As a bonus action on each of your turns before the spell ends, you can change the direction in which the line blasts from you.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Druid", "Sorcerer", "Wizard"]
}
