{
    "name": "Arcane Gate",
    "level": "6th Level",
    "type": "Conjuration",
    "casttime": "1 action",
    "range": "500 ft",
    "components": "V, S",
    "duration": "Concentration, up to 10 minutes",
    "description": "You create linked teleportation portals that remain open for the duration. Choose two points on the ground that you can see, one point within 10 feet of you and one point within 500 feet of you. A circular portal, 10 feet in diameter, opens over each point. If the portal would open in the space occupied by a creature, the spell fails, and the casting is lost. The portals are two-dimensional glowing rings filled with mist, hovering inches from the ground and perpendicular to it at the points you choose. A ring is visible only from one side (your choice), which is the side that functions as a portal. Any creature or object entering the portal exits from the other portal as if the two were adjacent to each other; passing through a portal from the nonportal side has no effect. The mist that fills each portal is opaque and blocks vision through it. On your turn, you can rotate the rings as a bonus action so that the active side faces in a different direction.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Sorcerer", "Warlock", "Wizard"]
}, {
    "name": "Chain Lightning",
    "level": "6th Level",
    "type": "Evocation",
    "casttime": "1 action",
    "range": "150 ft",
    "components": "V, S, M",
    "duration": "Instant",
    "description": "You create a bolt of lightning that arcs toward a target of your choice that you can see within range. Three bolts then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the bolts. A target must make a Dexterity saving throw. The target takes 10d8 lightning damage on a failed save, or half as much damage on a successful one. At Higher Levels. When you cast this spell using a spell slot of 7th level or higher, one additional bolt leaps from the first target to another target for each slot level above 6th.",
    "damagetype": "Lightning",
    "die": "10d8",
    "learnedby": ["Sorcerer", "Wizard"]
}, {
    "name": "Circle of Death",
    "level": "6th Level",
    "type": "Necromancy",
    "casttime": "1 action",
    "range": "150 ft",
    "components": "V, S, M",
    "duration": "Instant",
    "description": "A sphere of negative energy ripples out in a 60-foot-radius sphere from a point within range. Each creature in that area must make a Constitution saving throw. A target takes 8d6 necrotic damage on a failed save, or half as much damage on a successful one. At Higher Levels. When you cast this spell using a spell slot of 7th level or higher, the damage increases by 2d6 for each slot level above 6th.",
    "damagetype": "Necrotic",
    "die": "8d6",
    "learnedby": ["Sorcerer", "Warlock", "Wizard"]
}, {
    "name": "Disintegrate",
    "level": "6th Level",
    "type": "Transmutation",
    "casttime": "1 action",
    "range": "60 ft",
    "components": "V, S, M",
    "duration": "Instant",
    "description": "A thin green ray springs from your pointing finger to a target that you can see within range. The target can be a creature, an object, or a creation of magical force, such as the wall created by wall of force. A creature targeted by this spell must make a Dexterity saving throw. On a failed save, the target takes 10d6 + 40 force damage. If this damage reduces the target to 0 hit points, it is disintegrated. A disintegrated creature and everything it is wearing and carrying, except magic items, are reduced to a pile of fine gray dust. The creature can be restored to life only by means of a true resurrection or a wish spell. This spell automatically disintegrates a Large or smaller nonmagical object or a creation of magical force. If the target is a Huge or larger object or creation of force, this spell disintegrates a 10-foot-cube portion of it. A magic item is unaffected by this spell. At Higher Levels. When you cast this spell using a spell slot of 7th level or higher, the damage increases by 3d6 for each slot level above 6th.",
    "damagetype": "Force",
    "die": "10d6",
    "learnedby": ["Sorcerer", "Wizard"]
}, {
    "name": "Eyebite",
    "level": "6th Level",
    "type": "Necromancy",
    "casttime": "1 action",
    "range": "Self",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "description": "For the spell’s duration, your eyes become an inky void imbued with dread power. One creature of your choice within 60 feet of you that you can see must succeed on a Wisdom saving throw or be affected by one of the following effects of your choice for the duration. On each of your turns until the spell ends, you can use your action to target another creature but can’t target a creature again if it has succeeded on a saving throw against this casting of eyebite. A sleep. The target falls unconscious. It wakes up if it takes any damage or if another creature uses its action to shake the sleeper awake. Panicked. The target is frightened of you. On each of its turns, the frightened creature must take the Dash action and move away from you by the safest and shortest available route, unless there is nowhere to move. If the target moves to a place at least 60 feet away from you where it can no longer see you, this effect ends. Sickened. The target has disadvantage on attack rolls and ability checks. At the end of each of its turns, it can make another Wisdom saving throw. If it succeeds, the effect ends.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Bard", "Sorcerer", "Warlock", "Wizard"]
}, {
    "name": "Globe of Invulnerability",
    "level": "6th Level",
    "type": "Abjuration",
    "casttime": "1 action",
    "range": "Self (10 ft radius)",
    "components": "V, S, M",
    "duration": "Concentration, up to 1 minute",
    "description": "An immobile, faintly shimmering barrier springs into existence in a 10-foot radius around you and remains for the duration. Any spell of 5th level or lower cast from outside the barrier can't affect creatures or objects within it, even if the spell is cast using a higher level spell slot. Such a spell can target creatures and objects within the barrier, but the spell has no effect on them. Similarly, the area within the barrier is excluded from the areas affected by such spells. At Higher Levels. When you cast this spell using a spell slot of 7th level or higher, the barrier blocks spells of one level higher for each slot level above 6th.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Sorcerer", "Wizard"]
}, {
    "name": "Mass Suggestion",
    "level": "6th Level",
    "type": "Enchantment",
    "casttime": "1 action",
    "range": "60 ft",
    "components": "V, M",
    "duration": "24 hours",
    "description": "You suggest a course of activity (limited to a sentence or two) and magically influence up to twelve creatures of your choice that you can see within range and that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act automatically negates the effect of the spell. Each target must make a Wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do. You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a group of soldiers give all their money to the first beggar they meet. If the condition isn’t met before the spell ends, the activity isn’t performed. If you or any of your companions damage a creature affected by this spell, the spell ends for that creature. At Higher Levels. When you cast this spell using a 7th-level spell slot, the duration is 10 days. When you use an 8th-level spell slot, the duration is 30 days. When you use a 9th-level spell slot, the duration is a year and a day.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Bard", "Sorcerer", "Warlock", "Wizard"]
}, {
    "name": "Move Earth",
    "level": "6th Level",
    "type": "Transmutation",
    "casttime": "1 action",
    "range": "120 ft",
    "components": "V, S, M",
    "duration": "Concentration, up to 2 hours",
    "description": "Choose an area of terrain no larger than 40 feet on a side within range. You can reshape dirt, sand, or clay in the area in any manner you choose for the duration. You can raise or lower the area’s elevation, create or fill in a trench, erect or flatten a wall, or form a pillar. The extent of any such changes can’t exceed half the area’s largest dimension. So, if you affect a 40-foot square, you can create a pillar up to 20 feet high, raise or lower the square’s elevation by up to 20 feet, dig a trench up to 20 feet deep, and so on. It takes 10 minutes for these changes to complete. At the end of every 10 minutes you spend concentrating on the spell, you can choose a new area of terrain to affect. Because the terrain’s transformation occurs slowly, creatures in the area can’t usually be trapped or injured by the ground’s movement. This spell can’t manipulate natural stone or stone construction. Rocks and structures shift to accommodate the new terrain. If the way you shape the terrain would make a structure unstable, it might collapse. Similarly, this spell doesn’t directly affect plant growth. The moved earth carries any plants along with it.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Druid", "Sorcerer", "Wizard"]
}, {
    "name": "Sunbeam",
    "level": "6th Level",
    "type": "Evocation",
    "casttime": "1 action",
    "range": "Self (60 ft line)",
    "components": "V, S, M",
    "duration": "Concentration, up to 1 minute",
    "description": "A beam of brilliant light flashes out from your hand in a 5-foot-wide, 60-foot-long line. Each creature in the line must make a Constitution saving throw. On a failed save, a creature takes 6d8 radiant damage and is blinded until your next turn. On a successful save, it takes half as much damage and isn’t blinded by this spell. Undead and oozes have disadvantage on this saving throw. You can create a new line of radiance as your action on any turn until the spell ends. For the duration, a mote of brilliant radiance shines in your hand. It sheds bright light in a 30-foot radius and dim light for an additional 30 feet. This light is sunlight.",
    "damagetype": "Radiant",
    "die": "6d8",
    "learnedby": ["Druid", "Sorcerer", "Wizard"]
}, {
    "name": "True Seeing",
    "level": "6th Level",
    "type": "Divination",
    "casttime": "1 action",
    "range": "Touch",
    "components": "V, S, M",
    "duration": "1 hour",
    "description": "This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet.",
    "damagetype": "None",
    "die": "None",
    "learnedby": ["Bard", "Cleric", "Sorcerer", "Warlock", "Wizard"]
}
